---
kind: method
id: M:Autodesk.Revit.DB.DirectContext3D.DirectContext3DHandleOverrides.Dispose
source: html/12785ff9-15fb-c9f6-0aea-3402e32ea730.htm
---
# Autodesk.Revit.DB.DirectContext3D.DirectContext3DHandleOverrides.Dispose Method

Releases all resources used by the DirectContext3DHandleOverrides

## Syntax (C#)
```csharp
public void Dispose()
```